{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.7.2",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                5,
                28
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_3"
            },
            "name": "input_3",
            "inbound_nodes": []
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_2",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            },
            "name": "lstm_2",
            "inbound_nodes": [
              [
                [
                  "input_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "lstm_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_3",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_2",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.009999999776482582,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1E-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_2/kernel",
          "shape": [
            32,
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            4
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/kernel",
          "shape": [
            28,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}